#ifndef KEYBOARD_H
#define KEYBOARD_H

//----------------------------------------------------------------------------------------------------
//библиотеки
//----------------------------------------------------------------------------------------------------

#include <stdbool.h>
#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//перечисления
//----------------------------------------------------------------------------------------------------

typedef enum
{
 KEY_0=0,
 KEY_1,
 KEY_2,
 KEY_3,
 KEY_4,
 KEY_5,
 KEY_6,
 KEY_7,
 KEY_8,
 KEY_9,
 KEY_STAR,
 KEY_SHARP,
 KEY_AMOUNT,
 KEY_NONE
} KEY;

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------
void KEYBOARD_Init(void);//инициализация
void KEYBOARD_Scan(void);//произвести сканирование клавиатуры
bool KEYBOARD_GetKeyState(KEY key);//получить состояние клавиши
bool KEYBOARD_GetKeyPressedAndResetIt(KEY key);//получить, было ли нажатие клавиши с отпусканием и сбросить флаг этого состояния
KEY KEYBOARD_GetPressedKey(void);//получить нажатую кнопку

#endif
