#ifndef OUTPUT_H
#define OUTPUT_H

//----------------------------------------------------------------------------------------------------
//библиотеки
//----------------------------------------------------------------------------------------------------

#include <stdbool.h>
#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------
void OUTPUT_Init(void);//инициализация
void OUTPUT_OutputDigit(const uint8_t digit[4]);//вывести цифры
void OUTPUT_OutputOneDigit(uint8_t digit);//вывести одну цифру
void OUTPUT_OutputMinus(bool state);//отобразить знак "минус"
void OUTPUT_OutputPercent(bool state);//отобразить знак "процент"

#endif
