#ifndef RTC_H
#define RTC_H

//----------------------------------------------------------------------------------------------------
//библиотеки
//----------------------------------------------------------------------------------------------------

#include <stdbool.h>
#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------
void RTC_Init(void);//инициализация

void RTC_SetTime(uint8_t hour,uint8_t min,uint8_t sec);//установить время
void RTC_GetTime(uint8_t *hour,uint8_t *min,uint8_t *sec);//получить время

#endif
